<template>
  <section id="services" class="wrapper py-[60px] md:py-[80px]">
    <div class="flex justify-center lg:justify-start px-2">
      <h2 class="font-semibold border-orange-400 md:pb-2 text-3xl border-b-[5px]">Услуги</h2>
    </div>
    <div class="flex pt-10 space-y-10 flex-col">
      <div v-for="service in services" :key="service.title" class="flex space-y-6 md:space-y-0 flex-col md:flex-row md:space-x-10">
        <div class="md:w-96 w-full flex-shrink-0 md:h-52 h-60 bg-gray-200 rounded-lg overflow-hidden shadow-lg">
          <ImageLazy :src="service.img" class="w-full h-full object-cover object-center" />
        </div>
        <div>
          <h4 class="lg:text-3xl text-center md:text-left md:text-xl text-2xl font-semibold pb-3">
            {{ service.title }}
          </h4>
          <p class="text-sm lg:text-base text-center md:text-left">
            {{ service.desc }}
          </p>
        </div>
      </div>
    </div>
  </section>
</template>

<script setup>
import ImageLazy from './ImageLazy.vue'
const services = [
  {
    img: '/services/1.png',
    title: 'Широкоформатная печать баннеров',
    desc: 'Широкоформатная печать баннеров - наиболее распространенная услуга рекламно-производственных компаний. В силу того, что печать на баннере - входит в категорию самых недорогих заказов, такие изображения заказать может позволить себе любой рекламодатель. Другая особенность и аргумент в пользу баннеров - рекламные изображения получаются яркие, рекламные плоскости легкие и простые в установке. Кроме классических баннерных изображений, мы изготавливаем изображения на перфорированном баннере, перфорированной пленке, самоклеющейся пленке,  светоотражающей пленке.'
  },
  {
    img: '/services/2.png',
    title: 'Объемные буквы',
    desc: 'Объемные буквы - это очень яркий вид наружной рекламы, редко остающийся без внимания. Именно это позволяет считать его одним из самых действенных способов для привлечения внимания целевой аудитории к рекламной кампании, продукту или бренду. Можно сделать объемные буквы с подсветкой и без, на усмотрение рекламодателя. '
  },
  {
    img: '/services/3.png',
    title: 'Вывески',
    desc: 'Рекламная вывеска — доска, щит с различного вида  надписями, с изображением предметов продажи. Современная вывеска выполняет обычно две функции, которые сложно отделить одну от другой: это подача информации и реклама. Как средство рекламы вывеска относится к категории наружной рекламы и, прежде всего, выполняет имиджевую функцию. По сути, вывеска является визитной карточкой здания или помещения, помогая посетителю понять, что находится внутри, не заходя внутрь.'
  },
  {
    img: '/services/4.jpg',
    title: 'Таблички, указатели и штендеры',
    desc: 'Таблички и указатели из пластика с лазерной гравировкой. Благодаря простоте обработки пластика и его стойкостным характеристикам, по этой же технологии изготавливаются и таблички на ручках, переносные таблички и таблички не стандартной формы. Больше подходит для размещения внутри помещения. Таблички из алюкобонда с нанесением цветной самоклейки. Они являются самыми качественными и устойчивыми к любой погоде. Также мы изготавливаем таблички из дерева с индвивидуальным дизайном. Штендеры это переносная конструкция, которую устанавливают на улице, рядом с компанией-рекламодателем. Иногда штендеры размещают в помещениях. Его используют в качестве указателя, декоративного элемента или доски с информацией.'
  },
  {
    img: '/services/5.png',
    title: 'Лайтбоксы',
    desc: 'Световые короба, или лайтбоксы- один из самых популярных видов наружной рекламы, благодаря тому, что именно светящиеся информационные стенды и вывески на фасадах зданий, создают невероятную атмосферу ночного города. Как и у других рекламных носителей, основная задача лайтбокса-привлечение внимания и повышение узнаваемости среди потенциальной аудитории. С этой задачей он прекрасно справляется.'
  },
  {
    img: '/services/6.png',
    title: 'Бейджики, визитки',
    desc: 'Фирменный стиль любой компании, заведения, учреждения требует наличие у сотрудников наличие бейджей - нагрудных карточек с информацией о компании, должности, имени персонала или сотрудников. Вы можете заказать бейдж с креплением на магните или булавке для надежной фиксации на одежде персонала. Визитки и бейджики – неотъемлемые элементы фирменного стиля компании. Они передают клиенту минимум самой необходимой информации.'
  },
  {
    img: '/services/7.png',
    title: 'Информационные стенды',
    desc: 'Информационные стенды незаменимы даже в наше время высоких технологий. Они предназначены для наглядного отображения различной информации. Информационные стенды в обязательном порядке должны быть установлены в магазинах, местах общественного питания, детских учреждениях, больницах, образовательных учреждениях, а так же на предприятиях. Информационные стенды могут иметь разное название: уголок потребителя, доска информации, доска почета и пр. Изготавливаем мы их из современных качественных материалов – фанера, оргстекло, композит, акрил, форекс.'
  },
  {
    img: '/services/8.png',
    title: 'Roll-up',
    desc: 'Ролл-ап — мобильный раздвижной рекламный стенд с баннером, сматывающимся в металлическую конструкцию. Назначение ролл-ап стенда -  демонстрация информации и передача сообщения на любом мероприятии, выставке, конференции в офисе или торговом зале. Там где необходимо привлечь внимание и передать информацию о продукции, услугах или о компании.'
  },
  {
    img: '/services/9.png',
    title: 'Press-wall',
    desc: 'Пресс-волл – это баннер, натянутый на каркас, который предназначен для оформления интерьера при проведении какого-либо события (пресс-конференции, выставки, презентации, показа, церемонии и так далее). Информация на таком баннере имеет рекламный, презентационный или просто информативный характер.'
  },
  {
    img: '/services/10.png',
    title: 'Паук',
    desc: 'Баннер Паук — один из самых популярных типов внутренней передвижной рекламы. Конструктивные особенности заложены в его названии — устройство состоит из четырех расходящихся в разные стороны ножек для крепления полотна и опорной стойки. Баннер Паук— эффективный рекламный инструмент по минимальной цене'
  },
  {
    img: '/services/11.png',
    title: 'Фотопечать',
    desc: 'Каждый человек сталкивается с ситуацией, когда необходимы услуги фотопечати. Однако найти компанию, которая предлагает их довольно сложно. Качественная фотопечать делается на профессиональном оборудовании с использованием специальных расходных материалов.'
  },
  {
    img: '/services/12.png',
    title: 'Фрезерная резка',
    desc: 'Фрезерная резка – это механическая обработка твердых материалов с целью получения фигурных или объемных элементов, деталей, конструкций. На фрезерном станке можно обрабатывать различные материалы: форекс, дерево, акрил, пластик и т.д.'
  },
  {
    img: '/services/13.png',
    title: 'Лазерная резка',
    desc: 'Лазерная резка — технология резки и раскроя материалов, использующая лазер высокой мощности. Сфокусированный лазерный луч, обеспечивает высокую концентрацию энергии и позволяет разрезать практически любые материалы, например такие как: фанера, пластик, акрил и т.д. Также лазерный станок имеет функцию нанесения гравировки на вышеперечисленнные материалы.'
  },
  {
    img: '/services/14.png',
    title: 'Плоттерная резка ',
    desc: 'Плоттерная резка — технология, которая позволяет прорезать до подложки, высекать, перфорировать, резать насквозь материал вдоль контура изображения из различных материалов, например, из самоклеящейся плёнки. Резка называется «плоттерной» из-за того, что этот процесс производит специальный высокоточный аппарат — плоттер.'
  },
  {
    img: '/services/15.png',
    title: '3D-печать',
    desc: '3D-печать – это методика изготовления объемных изделий на основе цифровых моделей. Независимо от конкретной технологии, суть процесса заключается в постепенном послойном воспроизведении объектов. В этом процессе применяется особое устройство – 3D принтер, который печатает определенными видами материалов.'
  },
  {
    img: '/services/16.png',
    title: 'Волоконный лазерный маркер',
    desc: 'Волоконный лазерный маркер – оборудование, применяемое для нанесения гравировок и надписей, например на пластмассу, пластик, а так же на большинство видов твердых металлов.'
  }
]
</script>
